{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"right_hand_frames_input:0": {"name": "right_hand_frames_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "21"}, {"size": "2"}]}}, "left_hand_frames_input:0": {"name": "left_hand_frames_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "21"}, {"size": "2"}]}}, "pose_frames_input:0": {"name": "pose_frames_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "13"}, {"size": "2"}]}}, "face_frames_input:0": {"name": "face_frames_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "24"}, {"size": "2"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "56"}]}}}}}, "modelTopology": {"node": [{"name": "face_frames_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "24"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "left_hand_frames_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "21"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pose_frames_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "13"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "right_hand_frames_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "21"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^face_frames_input", "^left_hand_frames_input", "^pose_frames_input", "^right_hand_frames_input"]}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_21/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "812"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_20/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_19/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_18/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_17/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_16/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_15/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_2/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_1/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape/Reshape/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "169"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_1/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_2/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_2/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_5/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_4/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_3/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_1/Reshape_1/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_3/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "84"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_3/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_4/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_4/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_5/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_5/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_8/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_7/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_6/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_3/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_2/Reshape_2/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_6/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "84"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_6/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_7/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_7/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_8/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_8/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_11/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_10/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_3/Reshape_3/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_9/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_10/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_10/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_11/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_11/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Identity", "input": ["left_hand_frames_input", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_14/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_14/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_13/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_13/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/mul", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Identity", "input": ["right_hand_frames_input", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_4/Reshape_4/shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "441"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_13/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_14/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_15/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "688"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_15/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_16/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_16/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_17/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_17/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_18/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_18/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_19/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_19/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_20/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_20/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_110", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "812"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_21/batchnorm/sub", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "812"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_115", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "812"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_116", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1", "op": "ExpandDims", "input": ["pose_frames_input", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_5/ExpandDims_5", "op": "ExpandDims", "input": ["face_frames_input", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_7/ExpandDims_7", "op": "ExpandDims", "input": ["Func/StatefulPartitionedCall/input/_3", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_9/ExpandDims_9", "op": "ExpandDims", "input": ["Func/StatefulPartitionedCall/input/_4", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims", "op": "ExpandDims", "input": ["pose_frames_input", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/concatenate/concat", "op": "ConcatV2", "input": ["Func/StatefulPartitionedCall/input/_3", "Func/StatefulPartitionedCall/input/_4", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_4/ExpandDims_4", "op": "ExpandDims", "input": ["face_frames_input", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_6/ExpandDims_6", "op": "ExpandDims", "input": ["Func/StatefulPartitionedCall/input/_3", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_8/ExpandDims_8", "op": "ExpandDims", "input": ["Func/StatefulPartitionedCall/input/_4", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub/sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims/ExpandDims", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_1/ExpandDims_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/concatenate/concat", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "13"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/concatenate/concat", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_1/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "13"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_3/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/concatenate/concat", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_3/strided_slice_3/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub_3/sub_3", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_4/ExpandDims_4", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_5/ExpandDims_5"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub_4/sub_4", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_6/ExpandDims_6", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_7/ExpandDims_7"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub_5/sub_5", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_8/ExpandDims_8", "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_9/ExpandDims_9"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub/sub", "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub_1/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice/strided_slice", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_1/strided_slice_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_4/strided_slice_4", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "13"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_5/strided_slice_5", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_1/strided_slice_1/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "13"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sum_1/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub_3/sub_3", "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sum_2/Sum_2", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub_4/sub_4", "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sum_3/Sum_3", "op": "Sum", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub_5/sub_5", "StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum/reduction_indices"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sqrt/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sum/Sum"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub_1/sub_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "13"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "13"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_sub_2/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_4/strided_slice_4", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_5/strided_slice_5"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_1/Sqrt_1", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sum_1/Sum_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_2/Sqrt_2", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sum_2/Sum_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_3/Sqrt_3", "op": "Sqrt", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sum_3/Sum_3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sqrt/Sqrt", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape/Reshape/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_2/ExpandDims_2", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_6/strided_slice_6", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_sub_2/sub_2", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_1", "StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_2/strided_slice_2/stack_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "13"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "13"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_3/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_1/Sqrt_1", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_3/Reshape_3/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_4/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_2/Sqrt_2", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_4/Reshape_4/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_5/Reshape_5", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Sqrt_3/Sqrt_3", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_4/Reshape_4/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape/Reshape", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_concat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_2/ExpandDims_2", "StatefulPartitionedCall/model_1/tf_op_layer_sub_1/sub_1", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_3/ExpandDims_3", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_strided_slice_6/strided_slice_6", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_9/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape_3/Reshape_3", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape_4/Reshape_4", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape_5/Reshape_5", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_concat/concat", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_1/Reshape_1/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_concat_1/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_ExpandDims_3/ExpandDims_3", "StatefulPartitionedCall/model_1/tf_op_layer_sub_2/sub_2", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_9/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/conv1d_9/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/conv1d_9/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape_1/Reshape_1", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_2/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_concat_1/concat_1", "StatefulPartitionedCall/model_1/tf_op_layer_Reshape_2/Reshape_2/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_9/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/conv1d_9/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/model/conv1d_12/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/batch_normalization/batchnorm/mul", "StatefulPartitionedCall/model_1/conv1d/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_3/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_6/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_1/tf_op_layer_Reshape_2/Reshape_2", "StatefulPartitionedCall/model_1/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/mul", "StatefulPartitionedCall/model_1/conv1d_9/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/mul", "StatefulPartitionedCall/model_1/model/conv1d_12/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model_1/batch_normalization_12/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/mul", "StatefulPartitionedCall/model_1/model_1/conv1d_12/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model_1/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_1/conv1d_3/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv1d_6/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_1/conv1d_6/conv1d/ExpandDims", "StatefulPartitionedCall/model_1/conv1d_6/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/mul_1", "StatefulPartitionedCall/model_1/batch_normalization_9/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/model/batch_normalization_12/batchnorm/add_1", "op": "AddV2", "input": 