{"format": "graph-model", "generatedBy": "2.0.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/ld_21_3d/Reshape/shape/1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Pad/Pad/paddings", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize/ResizeBilinear/resize/ResizeBilinear/size", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize_1/ResizeBilinear/resize_1/ResizeBilinear/size", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize_2/ResizeBilinear/resize_2/ResizeBilinear/size", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Pad_1/Pad_1/paddings", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Pad_3/Pad_3/paddings", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ld_21_3d/strided_slice/stack", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/ld_21_3d/strided_slice/stack_1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/output_handedness/Reshape/shape/1", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_18/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_18/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_19/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_19/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_20/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_20/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_21/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_21/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_22/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_22/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_23/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_23/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_24/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_24/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_25/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_25/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_26/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_26/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_27/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_27/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_28/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_28/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_29/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_29/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_30/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_30/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_31/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_31/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_32/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_32/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_33/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_33/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_34/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_34/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_35/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_35/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_36/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_36/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_37/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_37/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_38/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_38/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_39/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_39/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_40/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_40/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_41/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_41/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_42/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_42/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_43/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_43/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_44/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_44/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv_handedness/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv_handedness/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv_handflag/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv_handflag/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/convld_21_3d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/convld_21_3d/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "288"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_18/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_19/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_20/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_21/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_22/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_23/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_24/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_25/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_26/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_27/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_28/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_29/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_30/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_31/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_32/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_33/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_34/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_35/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_36/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_37/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_38/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_39/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_40/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_41/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_42/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "288"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise/ReadVariableOp", "op": "Const", "input": ["^input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/re_lu/Relu", "op": "_FusedConv2D", "input": ["input", "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_187", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_10/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_10/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_11/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_11/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_12/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_12/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_13/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_13/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_14/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_14/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_16/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_16/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_17/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_17/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_18/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_18/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_19/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_19/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_20/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_20/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_21/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_21/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_22/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_22/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_23/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_23/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_24/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_24/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_25/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_25/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_26/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_26/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_27/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_27/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_28/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_28/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_29/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_29/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_30/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_30/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_31/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_31/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_32/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_32/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_33/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_33/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_34/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_34/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_35/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_35/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_36/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_36/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_37/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_37/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_38/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_38/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_39/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_39/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_4/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_40/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_40/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_41/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_41/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_42/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_42/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_43/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_43/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_44/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_44/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_5/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_5/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_6/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_6/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_7/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_7/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_8/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_8/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_9/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_9/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv_handedness/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv_handedness/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv_handflag/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv_handflag/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/convld_21_3d/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/convld_21_3d/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_18/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_19/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_20/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_21/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_22/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_23/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_24/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_25/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_26/depthwise/ReadVariableOp", "^StatefulPartitionedCall/model/depthwise_conv2d_27/depthwise/ReadVariableOp", 