{
    "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
    "format": "graph-model",
    "generatedBy": "2.2.0",
    "modelTopology": {
      "library": {},
      "node": [
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "shape": {
              "shape": {
                "dim": [
                  {
                    "size": "-1"
                  },
                  {
                    "size": "257"
                  },
                  {
                    "size": "257"
                  },
                  {
                    "size": "3"
                  }
                ]
              }
            }
          },
          "name": "input",
          "op": "Placeholder"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "36"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_56",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "36"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_57",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "36"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_58",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "36"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_59",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "19"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_62",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "19"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_63",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "24"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_2",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "24"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_3",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "24"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_4",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "24"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_5",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "24"
                    },
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_6",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_50",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_7",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "48"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_8",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_9",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "48"
                    },
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_10",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_51",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_11",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "96"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_12",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_13",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "96"
                    },
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_14",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_15",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_52",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "96"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_16",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "96"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_17",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "96"
                    },
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_18",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_19",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_53",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "192"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_20",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_21",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "192"
                    },
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_22",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_23",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "192"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_24",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_25",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "192"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_26",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_54",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_27",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_28",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_29",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_30",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_55",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_31",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "38"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_60",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_32",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_33",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_34",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_35",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_36",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_37",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_38",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_39",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_40",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_41",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_42",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "38"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_61",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_43",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_44",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_45",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_46",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_47",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "3"
                    },
                    {
                      "size": "3"
                    },
                    {
                      "size": "384"
                    },
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_48",
          "op": "Const"
        },
        {
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "384"
                    }
                  ]
                }
              }
            }
          },
          "input": [
            "^input"
          ],
          "name": "Func/StatefulPartitionedCall/input/_49",
          "op": "Const"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "epsilon": {
              "f": 0.0
            },
            "explicit_paddings": {
              "list": {}
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            },
            "use_cudnn_on_gpu": {
              "b": true
            }
          },
          "device": "/device:CPU:0",
          "input": [
            "input",
            "Func/StatefulPartitionedCall/input/_2",
            "Func/StatefulPartitionedCall/input/_3"
          ],
          "name": "StatefulPartitionedCall/model/conv2d/Relu",
          "op": "_FusedConv2D"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            }
          },
          "input": [
            "StatefulPartitionedCall/model/conv2d/Relu",
            "Func/StatefulPartitionedCall/input/_4",
            "Func/StatefulPartitionedCall/input/_5"
          ],
          "name": "StatefulPartitionedCall/model/depthwise_conv2d/depthwise",
          "op": "FusedDepthwiseConv2dNative"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "epsilon": {
              "f": 0.0
            },
            "explicit_paddings": {
              "list": {}
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "use_cudnn_on_gpu": {
              "b": true
            }
          },
          "device": "/device:CPU:0",
          "input": [
            "StatefulPartitionedCall/model/depthwise_conv2d/depthwise",
            "Func/StatefulPartitionedCall/input/_6",
            "Func/StatefulPartitionedCall/input/_7"
          ],
          "name": "StatefulPartitionedCall/model/conv2d_1/Relu",
          "op": "_FusedConv2D"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "2",
                  "2",
                  "1"
                ]
              }
            }
          },
          "input": [
            "StatefulPartitionedCall/model/conv2d_1/Relu",
            "Func/StatefulPartitionedCall/input/_8",
            "Func/StatefulPartitionedCall/input/_9"
          ],
          "name": "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise",
          "op": "FusedDepthwiseConv2dNative"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "epsilon": {
              "f": 0.0
            },
            "explicit_paddings": {
              "list": {}
            },
            "fused_ops": {
              "list": {
                "s": [
                  "Qmlhc0FkZA==",
                  "UmVsdQ=="
                ]
              }
            },
            "num_args": {
              "i": "1"
            },
            "padding": {
              "s": "U0FNRQ=="
            },
            "strides": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
                  "1"
                ]
              }
            },
            "use_cudnn_on_gpu": {
              "b": true
            }
          },
          "device": "/device:CPU:0",
          "input": [
            "StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise",
            "Func/StatefulPartitionedCall/input/_10",
            "Func/StatefulPartitionedCall/input/_11"
          ],
          "name": "StatefulPartitionedCall/model/conv2d_2/Relu",
          "op": "_FusedConv2D"
        },
        {
          "attr": {
            "T": {
              "type": "DT_FLOAT"
            },
            "data_format": {
              "s": "TkhXQw=="
            },
            "dilations": {
              "list": {
                "i": [
                  "1",
                  "1",
                  "1",
